dictionary = {
    'send_contact': 'Пройдите авторизацию через телефон номер 📲',
    'share_contact': 'Поделится контактом 📞',
    'send_your_contact': 'Пожалуйста, отправьте свой номер!',
    'change_lang_success': 'Язык успешно изменен 🇷🇺',
    'authorization': 'Авторизация прошла успешно✅',
    'admin': {
        'welcome': '🚀 Добро пожаловать, Админ!',
        'groups': 'Группы🗓',
        'today_lessons': 'Уроки на сегодня🚀',
        'news': '📢 Сделать рассылку',
        'add_member': 'Добавить 🙍‍♂️/🙍‍♀',
        'cancel_lesson': '❌ Отменить урок',
        'cancel_all_lessons': '❌ Отменить все уроки',
        'applications': 'Заявки📩',
        'gen_cer': 'Создать сертификат 🪪',
        'choose_group_to_add': '🔄 Выберите в какую группу добавить',
        'choose_group_to_cancel': 'Выберите группы для отмены урока',
        'text_for_news': 'Напиши текст для рассылки',
        'group_info_text': ('\n━━━━━━━━━━━━━━━━━━━\n'
                            '✨ <b>Группа:</b> GROUP {name}\n'
                            '📚 <b>Предмет:</b> {subject}\n'
                            '👨‍🏫 <b>Учитель:</b> {teacher}\n'
                            '🕒 <b>Время:</b> {time}\n'
                            '━━━━━━━━━━━━━━━━━━━\n'),
        'no_lessons_text' : '🌟 <b>На сегодня нету уроков!</b> 🌟\n━━━━━━━━━━━━━━━━━\n\n\n',
        'today_lessons_text': '🌟 <b>Сегодняшние уроки!</b> 🌟\n✨ Начни день с знаний и вдохновения!\n━━━━━━━━━━━━━━━━━━━\n\n',
        'reason': '📝 Напишите причину',
        'no_applications_text': 'Админ, пока тишина!\nБудьте готовы к действиям, всё под контролем! 🌟',
        'applications_text': ('\nИмя: {name}\n'
                              'Номер: +{phone}\n'
                              'Заявка: \n{application}\n'
                              '━━━━━━━━━━━━━━━━━━━\n'),
        'offline': 'Офлайн',
        'online': 'Онлайн',
        'back': 'Назад',
        'confirm': 'Подтвердить✅',
        'cancel_group': 'Отмена❌'
    },
    'teacher':{
        'welcome': '📚 Добро пожаловать, Учитель!',
        'my_groups': '👥 Мои группы',
        'today_lessons' : ('\n━━━━━━━━━━━━━━━━━━━\n'
                           '✨ <b>Группа:</b> GROUP {name}\n'
                           '📚 <b>Предмет:</b> {subject}\n'
                           '🕒 <b>Время:</b> {time}\n'
                           '━━━━━━━━━━━━━━━━━━━\n\n'),
    },
    'ceo':{
        'welcome': '✨ Добро пожаловать, CEO! ✨',
        'add_employee': 'Добавить сотрудника👨‍💼',
        'add_subject': '📖 Добавить предмет',
    },
    'user':{
        'welcome': 'Привет, ',
        'application': '✍️ Оставить заявку',
        'application_text': 'Готовы сделать шаг вперёд? \nНапишите нам, и мы обязательно свяжемся с вами!',

    },
    'role_admin': 'Админ',
    'role_teacher': 'Учитель',
    'info': '🌟 Информация о учебном центре',
    'info_about_center' : '🎓О учебном центре Black Duke \nМесто, где знания становятся силой. \nBlack Duke — это учебный центр, который обучает основным предметам школьной программы с акцентом на углублённые знания. Мы стремимся дать студентам не только базовые знания, но и навыки, которые помогут им развиваться и быть успешными в будущем. \nНаши курсы охватывают такие предметы, как математика, физика, химия, литература и другие основные дисциплины, обеспечивая качественное образование.',
    'idk': 'Не понятно🤷‍♂️',
    'remind_hour' :('⏰ Напоминание!\nУ вас урок через 1 час — {lesson_time}. Не забудьте подготовиться! 🎒📚.'),
    'remind_15min': ('⏳ Напоминание!\nУ вас урок через 15 минут — {lesson_time}'),
    'group_info' : ('🎓 Информация о группе\n'
                    '╔═══════════════════╗\n'
                    '🔥 Группа: GROUP {name}\n'
                    '🆔 ID: {group_id}\n'
                    '📅 Старт: {date}\n'
                    '⏰ Время: {time} (GMT+5)\n'
                    '📚 Дни: {day}\n'
                    '✏️ Предмет: {subject}\n'
                    '👨‍🏫 Преподаватель: {teacher}\n'
                    '🌍 Язык: {lang}\n'
                    '🔗 Формат: {group_mode}\n'
                    '╚═══════════════════╝\n'
                    '✨ Ваша точка входа в знания:\n'
                    '<a href="{link}">📌 Вступить в группу</a>'),
    'group_name': '📚 Введите название группы',
    'group_date': 'На какую дату назначено начало группы? 🧐',
    'wrong_date': '⚠️ Вы выбрали неправильную дату!\n🔁Начните заново',
    'group_time': 'Во сколько хотите ввести или выбрать время? Например, 10:30. 🕒',
    'group_subject': '📚 Выберите предмет',
    'group_teacher': '👨‍🏫 Выберите учителя',
    'group_lang':'🌍Выберите язык обучения',
    'group_mode': '🌐❓Выберите формат обучения',
    'group_create_info':('🎓 Информация о группе\n'
        '╭━ ⋆ 🎯 Детали группы ⋆ ━╮\n'
        '🔹 Название: {name}\n'
        '🔹 Дата старта: {date}\n'
        '🔹 Время занятий: {time} (GMT+5)\n'
        '🔹 Дни занятий: {day}\n🔹'
        ' Предмет: {subject}\n'
        '🔹 Преподаватель: {teacher}\n'
        '🔹 Язык обучения: {lang}\n'
        '🔹 Формат: {group_mode}\n'
        '╰━━━━━━━━━━━━━━━╯'),
    'group_desc': ('Дата: {date}\n'
                   'Время: {time}\n'
                   'Учитель: {teacher}'),
    'create_group': ('🎉 GROUP {name} создана и готова к успеху! ✅ \n'
                     'Вы можете присоединиться прямо сейчас! \n'
                     '🌐 Вот ваша ссылка: {link} \n'
                     'Начинайте ваш путь к новым знаниям и достижениям! 🚀'),
    'cancel_group': 'Создание группы было отменено☹️',
    'add_to_group': ('🤖 Бот добавил вас в GROUP {name}!'),
    'error_to_add_group': ('<b>🚫 Ошибка при добавлении в группу:</b>\n'
                           '\nГруппа GROUP {name} была успешно создана 🎉, однако возникла проблема при добавлении вас в неё. 😔\n'
                           'К сожалению, ваши настройки конфиденциальности в Telegram не позволяют нам добавить вас в группу.\n'
                           '⚠️ Это может быть связано с ограничениями, установленными для новых участников или настройками приватности.\n'
                           '🔗 Но не переживайте! Вот ссылка для присоединения к группе: {link}\n'
                           'Ждем вас🌟'),
    'odd_days': 'Пн • Ср • Пт',
    'even_days': 'Вт • Чт • Сб',
    'student_name': 'Напишите ФИО студента🧑‍🎓',
    'cer_date': 'Введите дату🗓️',
    'choose_employee_role': '👥 Выберите роль сотрудника',
    'employee_name': '👥 Как зовут сотрудника?',
    'write_phone': '📱 Введите номер телефона без + ( 998903345604 )',
    'employee_in_db': ('⚠️ Сотрудник уже есть в базе \n'
                    'Его роль: {role} \n'
                    'Если вы хотите изменить его должность, сначала удалите его из базы и добавьте снова с новой ролью. 🔄'),
    'add_employee_successfully': '🎉 Сотрудник успешно добавлен! ✅',
    'course_max_lessons': '📚 Сколько всего уроков в этом курсе?',
    'add_subject_text': '📚 Напишите название предмета',
    'add_subject_successfully': 'Предмет успешно добавлен✅',
    'send_excel_text': '📂 Отправьте Excel файл (.xlsx)',
    'wrong_excel': 'Пожалуйста, отправьте файл в формате Excel (.xlsx)',
    'columns_excel': 'Файл должен содержать столбцы: "Имя" и "Юзернейм"',
    'send_message_text': ('Здравствуйте, <b> {name} </b>! 🌟\n'
                          'С радостью сообщаем, что ваша группа по курсу <b> {subject} </b> стартует <b> {date} </b> в <b> {time} </b>! ⏰\n'
                          'Вы будете учиться с нашим замечательным преподавателем — <b> {teacher} </b>, который проведет увлекательное занятие. 📚✨\n'
                          'Язык занятия: <b> {lang} </b>\n'
                          'Формат: <b> {group_mode} </b>\n'
                          'А вот и ссылка на группу, где вы встретите свою команду и начнете путь к новым знаниям:\n'
                          '🔗 <b> {link} </b>\n'
                          'Готовы начать? Мы ждем вас с нетерпением! Если возникнут вопросы или потребуется помощь, не стесняйтесь обращаться. 😉\n'
                          'Увидимся на занятии! 🚀'),
    'error_with_sending': ('Не возможно отправить сообщение для {name} ({username})'),
    'send_message_successfully': '📤 Сообщения успешно отправлены!',
    'application_text': '✅ Ваша заявка принята!\nСпасибо за ваш интерес!\nМы обязательно с вами свяжемся и обработаем ваш запрос в ближайшее время. 🌟',
    'all_groups_warning': 'Уроки у всех групп на сегодня были отменены, и все были предупреждены. 🚫📚',
    'groups_warning_text': ('😔 К сожалению, урок на сегодня был отменен\n'
                            'Причина: {reason}'),
    'one_group_warning': ('📚Урок у группы {group} отменен.\n'
                      'Причина: {reason}.\n'
                      'Все предупреждены.⚠'),
    'news_send_successfully': '📤 Рассылка была отправлена успешно!',
    'error': 'Произошла ошибка: ',
    'error_text':'❗Произошла какая-то ошибка,попробуйте снова. \nЕсли ошибка не исчезает , пожалуйста, свяжитесь с разработчиком 👨‍💻 @Khal1l_0 отправив скриншот и время ошибки'
}


